In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [3]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [4]:
pd.concat([india_weather,us_weather]) 
##bydefault axis is index

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

### Is this a vstack or hstack??

In [5]:
pd.concat([india_weather,us_weather],ignore_index=True)

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

### `Whenever there is index 0 new key is assigned

In [6]:
new=pd.concat([india_weather, us_weather], keys = ['India', 'USA'])
new

             city  temperature  humidity
India 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
USA   0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [7]:
new.loc['USA']

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## Horizontal concat

In [8]:
temperature_df  = pd.DataFrame({
    "city": ["mumbai","delhi","banglore",'chennai'],
    "temperature": [32,45,30,22,],
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30
3   chennai           22

In [9]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [10]:
pd.concat([temperature_df, windspeed_df], axis = 1)

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN
3   chennai           22     NaN        NaN

### By default concat performs outer join

In [11]:
#To perform inner join
pd.concat([temperature_df, windspeed_df], axis = 1, join='inner' )

     city  temperature    city  windspeed
0  mumbai           32  mumbai         12
1   delhi           45   delhi          7

In [12]:
windspeed_df = pd.DataFrame({
    "city": ["chennai","mumbai"],
    "windspeed": [15,12],
})
windspeed_df

      city  windspeed
0  chennai         15
1   mumbai         12

In [13]:
pd.concat([temperature_df, windspeed_df], axis = 1)

       city  temperature     city  windspeed
0    mumbai           32  chennai       15.0
1     delhi           45   mumbai       12.0
2  banglore           30      NaN        NaN
3   chennai           22      NaN        NaN

In [14]:
#Here mumbai got chennai

### To avoid this problem

In [15]:
pd.concat([temperature_df.set_index('city'), windspeed_df.set_index('city')], axis = 1).reset_index()

C:\Users\purva\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

      index  temperature  windspeed
0  banglore           30        NaN
1   chennai           22       15.0
2     delhi           45        NaN
3    mumbai           32       12.0

### for concat ,we have to write indexes..

### Using merge

In [16]:
pd.merge(temperature_df, windspeed_df, on='city')   #by default it do inner join

      city  temperature  windspeed
0   mumbai           32         12
1  chennai           22         15

In [17]:
pd.merge(temperature_df, windspeed_df, on='city', how='outer')   #how=left,right

       city  temperature  windspeed
0    mumbai           32       12.0
1     delhi           45        NaN
2  banglore           30        NaN
3   chennai           22       15.0

In [18]:
#for outer we can have indicator flag ..from which dataframe result had came
pd.merge(temperature_df,windspeed_df,on="city",how="outer",indicator=True)

       city  temperature  windspeed     _merge
0    mumbai           32       12.0       both
1     delhi           45        NaN  left_only
2  banglore           30        NaN  left_only
3   chennai           22       15.0       both

In [19]:
#when 2 dataframes have same columns
pd.merge(india_weather,us_weather,on="city")

Empty DataFrame
Columns: [city, temperature_x, humidity_x, temperature_y, humidity_y]
Index: []

In [20]:
#we got 0 rows as no city is common in between these 2 df